share/tutorials/incompressible/dym-pimple/oscillating_inlet_acmi_2d/0.org/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 1.8e-3;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           $internalField;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      $internalField;
    value           $internalField;
  }
  walls
  {
    type            epsilonWallFunction;
    value           $internalField;
  }
  defaultFaces
  {
    type            empty;
  }
  ACMI1_blockage
  {
    type            epsilonWallFunction;
    value           $internalField;
  }
  ACMI1_couple
  {
    type            cyclicACMI;
    value           $internalField;
  }
  ACMI2_blockage
  {
    type            epsilonWallFunction;
    value           $internalField;
  }
  ACMI2_couple
  {
    type            cyclicACMI;
    value           $internalField;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
