share/tutorials/incompressible/dym-pimple/oscillating_inlet_acmi_2d/system/decomposeParDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      decomposeParDict;
}

numberOfSubdomains 4;
method          scotch;
hierarchicalCoeffs
{
  n               (1 4 1);
  delta           0.001;
  order           xyz;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
